# INSERT DATA INTO dev_soc.
INSERT INTO `
('CHN', '中国'),
('JPN', '日本'),
('KOR', '韩国'),
('USA', '美国');


# INSERT DATA INTO dev.soc.state
INSERT INTO `state` (`
// 中国
('CHN', 'CHN011', '北京'),
('CHN', 'CHN012', '天津'),
('CHN', 'CHN013', '河北'),
('CHN', 'CHN014', '山西'),
('CHN', 'CHN015', '内蒙古'),
('CHN', 'CHN021', '辽宁'),
('CHN', 'CHN022', '吉林'),
('CHN', 'CHN023', '黑龙江'),
('CHN', 'CHN031', '上海'),
('CHN', 'CHN032', '江苏'),
('CHN', 'CHN033', '浙江'),
('CHN', 'CHN034', '安徽'),
('CHN', 'CHN035', '福建'),
('CHN', 'CHN036', '江西'),
('CHN', 'CHN037', '山东'),
('CHN', 'CHN041', '河南'),
('CHN', 'CHN042', '湖北'),
('CHN', 'CHN043', '湖南'),
('CHN', 'CHN044', '广东'),
('CHN', 'CHN045', '广西'),
('CHN', 'CHN046', '海南'),
('CHN', 'CHN050', '重庆'),
('CHN', 'CHN051', '四川'),
('CHN', 'CHN052', '贵州'),
('CHN', 'CHN053', '云南'),
('CHN', 'CHN054', '西藏'),
('CHN', 'CHN061', '陕西'),
('CHN', 'CHN062', '甘肃'),
('CHN', 'CHN063', '青海'),
('CHN', 'CHN064', '宁夏'),
('CHN', 'CHN065', '新疆'),
('CHN', 'CHN071', '台湾'),
('CHN', 'CHN081', '香港'),
('CHN', 'CHN082', '澳门'),
// 日本
('JPN', '', '北海道'),
('JPN', '', '青森县'),	
('JPN', '', '岩手县'),	
('JPN', '', '宫城县'),	
('JPN', '', '秋田县'),	
('JPN', '', '山形县'),	
('JPN', '', '福岛县'),	
('JPN', '', '茨城县'),	
('JPN', '', '栃木县'),
('JPN', '', '群马县'),	
('JPN', '', '埼玉县'),	
('JPN', '', '千叶县'),	
('JPN', '', '东京都'),
('JPN', '', '神奈川县'),
('JPN', '', '新潟县'),	
('JPN', '', '富山县'),	
('JPN', '', '石川县'),	
('JPN', '', '福井县'),	
('JPN', '', '山梨县'),	
('JPN', '', '长野县'),	
('JPN', '', '岐阜县'),	
('JPN', '', '静冈县'),	
('JPN', '', '爱知县'),
('JPN', '', '三重县'),
('JPN', '', '滋贺县'),	
('JPN', '', '京都府'),
('JPN', '', '大阪府'),
('JPN', '', '兵库县'),	
('JPN', '', '奈良县'),	
('JPN', '', '和歌山县'),
('JPN', '', '鸟取县'),	
('JPN', '', '岛根县'),	
('JPN', '', '冈山县'),	
('JPN', '', '广岛县'),	
('JPN', '', '山口县'),	
('JPN', '', '徳岛县'),	
('JPN', '', '香川县'),	
('JPN', '', '爱媛县'),	
('JPN', '', '高知县'),	
('JPN', '', '福冈县'),	
('JPN', '', '佐贺县'),	
('JPN', '', '长崎县'),	
('JPN', '', '熊本县'),	
('JPN', '', '大分县'),	
('JPN', '', '宫崎县'),	
('JPN', '', '鹿儿岛县'),
('JPN', '', '冲绳县'),

// 韩国
('KOR', 'KOR011', '首尔'),
('KOR', 'KOR026', '釜山'),
('KOR', 'KOR027', '大邱'),
('KOR', 'KOR028', '仁川'),
('KOR', 'KOR029', '光州'),
('KOR', 'KOR030', '大田'),
('KOR', 'KOR031', '蔚山'),
('KOR', 'KOR041', '济州特别自治道'),
('KOR', 'KOR042', '江原道'),
('KOR', 'KOR043', '庆尚北道'),
('KOR', 'KOR044', '庆尚南道'),
('KOR', 'KOR045', '忠清北道'),
('KOR', 'KOR046', '忠清南道'),
('KOR', 'KOR047', '全罗北道'),
('KOR', 'KOR048', '全罗南道'),
('KOR', 'KOR049', '京畿道'),
// 美国


('JPN023', )
('JPN005', )
('JPN002', )
('JPN012', )
('JPN038', )
('JPN018', )
('JPN040', )
('JPN007', )
('JPN021', )
('JPN010', )
('JPN034', )
('JPN001', )
('JPN028', )
('JPN008', )
('JPN017', )
('JPN003', )
('JPN037', )
('JPN046', )
('JPN014', )
('JPN039', )
('JPN043', )
('JPN026', )
('JPN024', )
('JPN004', )
('JPN045', )
('JPN020', )
('JPN042', )
('JPN029', )
('JPN015', )
('JPN044', )
('JPN033', )
('JPN047', )
('JPN027', )
('JPN041', )
('JPN011', )
('JPN025', )
('JPN032', )
('JPN022', )
('JPN009', )
('JPN036', )
('JPN013', )
('JPN031', )
('JPN016', )
('JPN030', )
('JPN006', )
('JPN035', )
('JPN019', )












































